{
  "units": [
    {
      "id": 1,
      "status": "En cours",
      "title": "1 : Les bases techniques",
      "name": "Technical Basics",
      "available": "true",
      "completedChapters": 1,
      "totalChapters": 3,
      "description": "Tu veux apprendre à utiliser ton appareil comme un pro ?\nCe module est fait pour toi ! On te montre comment maîtriser le clavier, comprendre les touches, et découvrir tous les gestes tactiles qui te permettent d’interagir avec ton écran.",
      "chapters": [
        {
          "id": 1,
          "status": "Terminé",
          "completedCourses": 2,
          "totalCourses": 2,
          "title": "Chapitre 1 : Dompte ton clavier!",
          "description": "Découvre les bases de la saisie et maîtrise ton clavier pour naviguer en toute confiance.",
          "courses": [
            {
              "id": 1,
              "status": "Terminé",
              "title": "Cours 1",
              "description": "Apprends à taper des mots simples comme \"bonjour\", puis passe à des phrases pour intégrer les espaces et majuscules. C’est la première étape pour transformer ton clavier en allié du quotidien !",
              "dialogs": [
                "Bonjour et bienvenue dans votre premier cours de maîtrise du clavier ! 🎉",
                "Aujourd'hui, on va commencer doucement : \nvotre mission est de recopier une phrase simple.",
                "Prêt(e) ? Allez, à vos claviers !"
              ],
              "images": ["assets/images/modules/1_basics/ch1/course1/step1.png"],
              "instructions": [
                "Étape 1 : À vos lettres ! 🔠",
                "Étape 2 : Cap sur les majuscules ! ⬆️🔠",
                "Étape 3 : Espace, le grand voyageur ⎵",
                "Étape 4 : La totale ! ⚫️"
              ],
              "descriptions": [
                "Consigne : Tapez le mot affiché à l'écran en utilisant uniquement des lettres minuscules. Prenez votre temps pour trouver les bonnes touches.",
                "Consigne : Tapez le mot affiché, mais cette fois, commencez avec une majuscule. Utilisez la touche Majuscule (ou Shift) pour y arriver.",
                "Consigne : Tapez la mini phrase affichée à l'écran. Vous devrez inclure des espaces entre les mots pour qu’elle soit correcte.",
                "Consigne : Tapez la phrase affichée en respectant les majuscules et les espaces."
              ],
              "expectations": [
                "bonjour",
                "Bonjour",
                "bonjour mon ami",
                "Bonjour Pierre"
              ],
              "end": "Bravo, tu as terminé ton 1er cours !"
            },
            {
              "id": 2,
              "title": "Cours 2 : Mets de la ponctuation dans ta vie !",
              "status": "Terminé",
              "description": "Explore les subtilités des apostrophes, guillemets, accents et ponctuations. Ces petits détails te permettront d’écrire avec clarté et précision, tout en soignant tes messages.",
              "dialogs": [
                "Bienvenue dans ce deuxième cours de maîtrise du clavier ! 🎉",
                "Aujourd'hui, on va continuer sur notre lancée : \nvotre mission est de recopier une phrase un peu plus complexe."
              ],
            "images": ["assets/images/keyboard.png"],
              "instructions": [
                "Étape 1 : Ajoutons des points",
                "Étape 2 : La virgule, un signe de ponctuation simple ,",
                "Étape 3 : La totale : majuscules et virgule ! ⚫️"
              ],
              "descriptions": [
                "Consigne : Tapez la phrase affiché à l'écran, prenez votre temps et n'oubliez pas la ponctuation.",
                "Consigne : Tapez la mini phrase affichée à l'écran. Vous devrez inclure des espaces entre les mots pour qu’elle soit correcte ainsi que la ponctuation.",
                "Consigne : La virgule",
                "Consigne : La virgule + ?"
              ],
              "expectations": [
                "bonjour.",
                "Bonjour Gilles!",
                "Bonjour, Pierre.",
                "Bonjour mon ami, comment vas-tu ?"
              ],
              "end": "Bravo, tu as terminé ton 2ème cours !"
            },
            {
              "id" : 3,
              "title": "Cours 3",
              "status" : "?",
              "description" : "Familiarise-toi avec la saisie des nombres et découvre des caractères essentiels comme +, -, et =. Idéal pour les calculs simples ou les codes, tu seras prêt à tout.",
              "dialogs": [
                "Bienvenue dans ce troisième cours ! 🎉",
                "On passe aux choses sérieuses : on découvre comment utiliser les chiffres et les caractères spéciaux associés.",
                "Prêt(e) à relever le défi ? Allez, à toi de jouer !"
              ],
            "images": ["assets/images/keyboard.png"],
              "instructions": [
                "Étape 1 : Saisie des chiffres \u0031\u0032\u0033...",
                "Étape 2 : Découverte des caractères +, -, et =.",
                "Étape 3 : Combine chiffres et symboles pour des calculs simples."

              ],
              "descriptions": [
                "Consigne : Tape le chiffre affiché à l'écran. Utilise la ligne supérieure du clavier (ou le pavé numérique si disponible).",
                "Consigne : Découvre les touches spéciales (+, -, =) et tape les symboles affichés.",
                "Consigne : Réalise des combinaisons simples, comme \"2+2=4\" ou \"5-3=2\", pour t'entraîner à utiliser les chiffres et les symboles."

              ],
              "expectations": [
                "1",
                "+",
                "2+2=4"
              ],
              "end": "Super travail ! Tu maîtrises maintenant les chiffres et les symboles de ton clavier. 🏆"
            }
          ]
        },
        {
          "id": 2,
          "title": "Chapitre 2 : .",
          "description": "...",
          "status": "Bientôt disponnible",
          "completedCourses": 0,
          "totalCourses": 0,
          "courses": [
            {
              "id": 1,
              "title": "Cours 1 : Découvre les bases de l'authentification",
              "status": "En cours",
              "description": "Apprends les bases pour utiliser des identifiants et des mots de passe. On t’explique leur importance et où les utiliser. Découvre aussi l’arobase (@) grâce aux adresses e-mail !",
              "dialogs": [
                "Bienvenue dans le monde de l'authentification ! 🚀",
                "Aujourd'hui, tu vas découvrir ce qu'est un identifiant et un mot de passe, et pourquoi ils sont indispensables pour naviguer en sécurité sur Internet.",
                "On va aussi parler du fameux arobase (@) et de son rôle dans les adresses e-mail. Allez, c’est parti !"
              ],
              "images": ["assets/images/keyboard.png"],
              "instructions": [
                "Étape 1 : Découvre ce qu'est un identifiant.",
                "Étape 2 : Apprends à quoi sert un mot de passe et pourquoi il est important.",
                "Étape 3 : Découvre le symbole @ avec un exemple d’adresse e-mail comme identifiant."
              ],
              "descriptions": [
                "Consigne : Lis les exemples et identifie les parties importantes d’une adresse e-mail (nom, arobase, domaine).",
                "Consigne : Tape un exemple d'adresse e-mail (par ex. : utilisateur@test.com) pour t’entraîner."
              ],
              "expectations": [
                "utilisateur@test.com"
              ],
              "end": "Bravo, tu sais maintenant ce qu'est un identifiant et un mot de passe, ainsi que leur importance !"
            },
            {
              "id": 2,
              "title": "Cours 2: Ton mot de passe, ton bouclier",
              "status": "En cours",
              "description" : "Apprends à reconnaître un mot de passe sécurisé avec des exercices simples et amusants. Puis, crée un mot de passe imbattable qui protège efficacement tes comptes.",
              "dialogs": [
                "On passe à une étape cruciale : la sécurité de tes mots de passe. 🔒",
                "Tu vas apprendre à reconnaître un mot de passe sécurisé et à en créer un facilement. C’est essentiel pour garder tes données en sécurité.",
                "Prêt(e) ? Allez, c’est parti !"
              ],
              "images": [""],
              "instructions": [
                "Étape 1 : Identifie si les mots de passe affichés sont sécurisés (réponds par Oui ou Non).",
                "Étape 2 : Crée un mot de passe sécurisé en respectant ces critères : au moins 8 caractères, lettres majuscules et minuscules, chiffres et symboles spéciaux.",
                "Étape 3 : Entraîne-toi à taper ton mot de passe sans erreur."
              ],
              "descriptions": [
                "Consigne : Analyse les mots de passe proposés et réponds par Oui ou Non pour indiquer s'ils sont sécurisés.",
                "Consigne : Crée un mot de passe unique en respectant les critères donnés.",
                "Consigne : Répète plusieurs fois la saisie de ton mot de passe pour bien le mémoriser."
              ],
              "expectations": [
                "Oui",
                "Non",
                "MotDePasse!2023"
              ],
              "end": "Excellent ! Tu sais maintenant créer et reconnaître un mot de passe sécurisé. 🎉"

            },
            {
              "id": 3,
              "title": "Cours 3 : Connecte-toi comme un pro",
              "status": "En cours",
              "description": "Mets en pratique tout ce que tu as appris ! Simule une connexion avec identifiant et mot de passe, et découvre des conseils pour bien gérer tes mots de passe.",
              "dialogs": [
                "C'est le moment de passer à la pratique ! 🚀",
                "Tu vas t’entraîner à te connecter à un compte en utilisant un identifiant et un mot de passe.",
                "On terminera avec des astuces pour gérer facilement tes mots de passe. C’est parti !"
              ],
            "images": ["assets/images/keyboard.png"],
              "instructions": [
                "Étape 1 : Tape l’identifiant affiché à l’écran.",
                "Étape 2 : Saisis le mot de passe associé.",
                "Étape 3 : Valide ta connexion.",
                "Étape 4 : Découvre les astuces pour bien gérer tes mots de passe (utiliser un gestionnaire de mots de passe, éviter de réutiliser les mêmes, etc.)."
              ],
              "descriptions": [
                "Consigne : Entre les informations demandées pour simuler une connexion (identifiant + mot de passe).",
                "Consigne : Découvre les conseils pour améliorer la gestion de tes mots de passe."
              ],
              "expectations": [
                "Identifiant : utilisateur@test.com",
                "Mot de passe : MotDePasse!2023"
              ],
              "end": "Super ! Tu maîtrises la connexion et tu sais comment gérer tes mots de passe en toute sécurité. 🔓"
            }
          ]
        },
        {
          "id": 3,
          "title": "Chapitre 3 : Toucher, glisser, maîtriser",
          "description": "Plongez dans l'univers des interactions tactiles et apprenez à maîtriser les gestes essentiels comme le toucher, le glisser ou le maintenir. Ce chapitre vous guidera pour naviguer en toute fluidité sur les écrans modernes.",
          "status": "Bientôt disponnible",
          "completedCourses": 0,
          "totalCourses": 0,
          "courses": []
        }
      ]
    },
    {
      "id" : 2,
      "status": "Pas commencé",
      "title": "2 : Décoder une interface numérique",
      "name": "Technical Interface",
      "available": "true",
      "completedChapters": 0,
      "totalChapters": 0,
      "description": "Tu te demandes à quoi servent toutes ces icônes sur ton écran ?\nDans ce module, tu apprendras à repérer et comprendre les essentiels comme le Wi-Fi, la batterie ou encore la luminosité. Ton appareil n'aura plus de secret pour toi !",
      "chapters": [
        {
          "id": 3,
          "status": "À venir",
          "title": "Chapter 3",
          "completedCourses": 0,
          "totalCourses": 2,
          "description": "This is the third chapter",
          "courses": [
            {
              "id": 1,
              "title": "Cours 1",
              "description": "",
              "dialogs": [
                ""
              ],
            "images": ["assets/images/keyboard.png"],
              "instructions": [
                ""
              ],
              "descriptions": [
                ""
              ],
              "expectations": [
                ""
              ],
              "end": ""
            }
          ]
        }
      ]
    },
    {
      "id" : 3,
      "status": "Pas commencé",
      "title": "3 : Aller plus loin avec son appareil",
      "name": "System",
      "available": "false",
      "completedChapters": 0,
      "totalChapters": 0,
      "description": "Ce module combine les compétences acquises dans les deux premiers modules pour une utilisation intermédiaire des appareils numériques.\nIl te montrera comment activer le Wi-Fi, lancer et organiser tes applications, télécharger ou désinstaller des outils, et même déplacer tes fichiers.",
      "chapters": []
    }
  ]
}
